package ru.nedovesov.konstantin.java_1;

/*
* 1. Написать метод вычисляющий выражение a * (b + (c / d)) и возвращающий результат с плавающей точкой,
*    где a, b, c, d – целочисленные входные параметры этого метода;
* 2. Написать метод, принимающий на вход два числа, и проверяющий что их сумма лежит
*    в пределах от 10 до 20(включительно), если да – вернуть true, в противном случае – false;
* 3. Написать метод, которому в качестве параметра передается целое число,
*    метод должен напечатать в консоль положительное ли число передали, или отрицательное;
*    Замечание: ноль считаем положительным числом.
* 4. Написать метод, которому в качестве параметра передается строка, обозначающая имя,
*    метод должен вывести в консоль сообщение «Привет, указанное_имя!»; Вывести приветствие
*    в консоль
* 5. * Написать метод, который определяет является ли год високосным, и выводит сообщение в консоль.
*    Каждый 4-й год является високосным, кроме каждого 100-го, при этом каждый 400-й – високосный.
*/
public class HomeWorkOne {
    public static void main(String[] args){
		
	}
}

